import { genKey } from 'draft-js'

export const blocks = `[1447α] [8]
περὶ ποιητικῆς αὐτῆς τε καὶ τῶν εἰδῶν αὐτῆς, ἥν τινα δύναμιν ἕκαστον ἔχει, καὶ
πῶς δεῖ συνίστασθαι τοὺς μύθους [10] εἰ μέλλει καλῶς ἕξειν ἡ ποίησις, ἔτι δὲ ἐκ
πόσων καὶ ποίων ἐστὶ μορίων, ὁμοίως δὲ καὶ περὶ τῶν ἄλλων ὅσα τῆς αὐτῆς ἐστι
μεθόδου, λέγωμεν ἀρξάμενοι κατὰ φύσιν πρῶτον ἀπὸ τῶν πρώτων.

ἐποποιία δὴ καὶ ἡ τῆς τραγῳδίας ποίησις ἔτι δὲ κωμῳδία καὶ ἡ διθυραμβοποιητικὴ
καὶ τῆς [15] αὐλητικῆς ἡ πλείστη καὶ κιθαριστικῆς πᾶσαι τυγχάνουσιν οὖσαι
μιμήσεις τὸ σύνολον: διαφέρουσι δὲ ἀλλήλων τρισίν, ἢ γὰρ τῷ ἐν ἑτέροις μιμεῖσθαι
ἢ τῷ ἕτερα ἢ τῷ ἑτέρως καὶ μὴ τὸν αὐτὸν τρόπον. ὥσπερ γὰρ καὶ χρώμασι καὶ
σχήμασι πολλὰ μιμοῦνταί τινες ἀπεικάζοντες （οἱ μὲν [20] διὰ τέχνης οἱ δὲ διὰ
συνηθείας）, ἕτεροι δὲ διὰ τῆς φωνῆς, οὕτω κἀν ταῖς εἰρημέναις τέχναις ἅπασαι
μὲν ποιοῦνται τὴν μίμησιν ἐν ῥυθμῷ καὶ λόγῳ καὶ ἁρμονίᾳ, τούτοις δ᾽ ἢ χωρὶς ἢ
μεμιγμένοις: οἷον ἁρμονίᾳ μὲν καὶ ῥυθμῷ χρώμεναι μόνον ἥ τε αὐλητικὴ καὶ ἡ
κιθαριστικὴ κἂν εἴ τινες [25] ἕτεραι τυγχάνωσιν οὖσαι τοιαῦται τὴν δύναμιν,
οἷον ἡ τῶν συρίγγων, αὐτῷ δὲ τῷ ῥυθμῷ [μιμοῦνται] χωρὶς ἁρμονίας ἡ τῶν ὀρχηστῶν
(καὶ γὰρ οὗτοι διὰ τῶν σχηματιζομένων ῥυθμῶν μιμοῦνται καὶ ἤθη καὶ πάθη καὶ
πράξεις:

ἡ δὲ [ἐποποιία] μόνον τοῖς λόγοις ψιλοῖς <καὶ> ἡ τοῖς [1447β] μέτροις καὶ
τούτοις εἴτε μιγνῦσα μετ᾽ ἀλλήλων εἴθ᾽ ἑνί τινι γένει χρωμένη τῶν μέτρων
ἀνώνυμοι τυγχάνουσι μέχρι τοῦ νῦν: οὐδὲν γὰρ ἂν [10] ἔχοιμεν ὀνομάσαι κοινὸν
τοὺς Σώφρονος καὶ Ξενάρχου μίμους καὶ τοὺς Σωκρατικοὺς λόγους οὐδὲ εἴ τις διὰ
τριμέτρων ἢ ἐλεγείων ἢ τῶν ἄλλων τινῶν τῶν τοιούτων ποιοῖτο τὴν μίμησιν. πλὴν οἱ
ἄνθρωποί γε συνάπτοντες τῷ μέτρῳ τὸ ποιεῖν ἐλεγειοποιοὺς τοὺς δὲ ἐποποιοὺς
ὀνομάζουσιν, οὐχ ὡς [15] κατὰ τὴν μίμησιν ποιητὰς ἀλλὰ κοινῇ κατὰ τὸ μέτρον
προσαγορεύοντες: καὶ γὰρ ἂν ἰατρικὸν ἢ φυσικόν τι διὰ τῶν μέτρων ἐκφέρωσιν, οὕτω
καλεῖν εἰώθασιν: οὐδὲν δὲ κοινόν ἐστιν Ὁμήρῳ καὶ Ἐμπεδοκλεῖ πλὴν τὸ μέτρον, διὸ
τὸν μὲν ποιητὴν δίκαιον καλεῖν, τὸν δὲ φυσιολόγον μᾶλλον ἢ [20] ποιητήν: ὁμοίως
δὲ κἂν εἴ τις ἅπαντα τὰ μέτρα μιγνύων ποιοῖτο τὴν μίμησιν καθάπερ Χαιρήμων
ἐποίησε Κένταυρον μικτὴν ῥαψῳδίαν ἐξ ἁπάντων τῶν μέτρων, καὶ ποιητὴν
προσαγορευτέον. περὶ μὲν οὖν τούτων διωρίσθω τοῦτον τὸν τρόπον.

εἰσὶ δέ τινες αἳ πᾶσι χρῶνται τοῖς [25] εἰρημένοις, λέγω δὲ οἷον ῥυθμῷ καὶ μέλει
καὶ μέτρῳ, ὥσπερ ἥ τε τῶν διθυραμβικῶν ποίησις καὶ ἡ τῶν νόμων καὶ ἥ τε τραγῳδία
καὶ ἡ κωμῳδία: διαφέρουσι δὲ ὅτι αἱ μὲν ἅμα πᾶσιν αἱ δὲ κατὰ μέρος. ταύτας μὲν
οὖν λέγω τὰς διαφορὰς τῶν τεχνῶν ἐν οἷς ποιοῦνται τὴν μίμησιν. `
  .split('\n')
  .map(text => ({
    depth: 0,
    type: 'unstyled',
    key: genKey(),
    text
  }))
